```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.packet_spot_market_request.dreq will be read during apply
  # (config refers to values not yet known)
 <= data "packet_spot_market_request" "dreq"  {
      ~ device_ids = [] -> (known after apply)
      ~ id         = "2f69cf3d-5505-4022-bfaf-0a725820661b" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + create  = (known after apply)
          + default = (known after apply)
          + delete  = (known after apply)
          + update  = (known after apply)
        }
    }

  # data.packet_spot_market_request.sreq will be read during apply
  # (config refers to values not yet known)
 <= data "packet_spot_market_request" "sreq"  {
      ~ device_ids = [] -> (known after apply)
      ~ id         = "7a1e3da3-28c4-4b32-a2f5-f6263fdf8e1f" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + create  = (known after apply)
          + default = (known after apply)
          + delete  = (known after apply)
          + update  = (known after apply)
        }
    }

  # aws_kms_key.kurl_testgrid_sops_key will be destroyed
  - resource "aws_kms_key" "kurl_testgrid_sops_key" {
      - arn                      = "arn:aws:kms:us-east-1:799720048698:key/3618fe99-0860-45bd-b9cb-d5b1fe971d4d" -> null
      - customer_master_key_spec = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days  = 7 -> null
      - description              = "KMS Key for sops" -> null
      - enable_key_rotation      = false -> null
      - id                       = "3618fe99-0860-45bd-b9cb-d5b1fe971d4d" -> null
      - is_enabled               = true -> null
      - key_id                   = "3618fe99-0860-45bd-b9cb-d5b1fe971d4d" -> null
      - key_usage                = "ENCRYPT_DECRYPT" -> null
      - policy                   = jsonencode(
            {
              - Id        = "key-default-1"
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::799720048698:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - tags                     = {} -> null
    }

  # packet_spot_market_request.base-request will be updated in-place
  ~ resource "packet_spot_market_request" "base-request" {
        id            = "2f69cf3d-5505-4022-bfaf-0a725820661b"
        # (5 unchanged attributes hidden)

      ~ instance_parameters {
          - always_pxe        = "" -> null
          - customdata        = "" -> null
          - description       = "" -> null
          - locked            = "" -> null
          - termintation_time = "" -> null
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change
          ~ userdata          = (sensitive)
            # (7 unchanged attributes hidden)
        }
    }

  # packet_spot_market_request.burst-request will be updated in-place
  ~ resource "packet_spot_market_request" "burst-request" {
        id            = "7a1e3da3-28c4-4b32-a2f5-f6263fdf8e1f"
        # (5 unchanged attributes hidden)

      ~ instance_parameters {
          - always_pxe        = "" -> null
          - customdata        = "" -> null
          - description       = "" -> null
          - locked            = "" -> null
          - termintation_time = "" -> null
          # Warning: this attribute value will no longer be marked as sensitive
          # after applying this change
          ~ userdata          = (sensitive)
            # (7 unchanged attributes hidden)
        }
    }

Plan: 0 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ burst-ids = [] -> (known after apply)
  ~ ids       = [] -> (known after apply)

------------------------------------------------------------------------
```